jobs/20260720-184320-luqia-vllm-pd-tcp-2node-r2/slurm-249403.out

===== allocation =====
time=2026-07-20T18:44:10+02:00
batch_host=ganymede
SLURM_JOB_ID=249403
SLURM_JOB_NODELIST=ganymede,neptune
SLURM_JOB_GPUS=1
model=mistralai/Mistral-7B-v0.1
prefill=neptune:32403 ip=10.1.0.6 iface=enp160s0f0np0
decode=ganymede:33403 ip=10.1.0.3 iface=eno12399np0
proxy=10.1.0.3:30403 registry_port=31403
kv_port=34403
ganymede
neptune
JobId=249403 JobName=20260720-184320-luqia-vllm-pd-tcp-2node-r2
   UserId=chjing(10271) GroupId=root(0) MCS_label=N/A
   Priority=1 Nice=0 Account=student QOS=normal
   JobState=RUNNING Reason=None Dependency=(null)
   Requeue=1 Restarts=0 BatchFlag=1 Reboot=0 ExitCode=0:0
   RunTime=00:00:01 TimeLimit=00:20:00 TimeMin=N/A
   SubmitTime=2026-07-20T18:44:09 EligibleTime=2026-07-20T18:44:09
   AccrueTime=2026-07-20T18:44:09
   StartTime=2026-07-20T18:44:09 EndTime=2026-07-20T19:04:09 Deadline=N/A
   SuspendTime=None SecsPreSuspend=0 LastSchedEval=2026-07-20T18:44:09 Scheduler=Main
   Partition=long AllocNode:Sid=minerva:919086
   ReqNodeList=ganymede,neptune ExcNodeList=(null)
   NodeList=ganymede,neptune
   BatchHost=ganymede
   NumNodes=2 NumCPUs=32 NumTasks=2 CPUs/Task=16 ReqB:S:C:T=0:0:*:*
   ReqTRES=cpu=16,mem=128G,node=2,billing=16,gres/gpu=2
   AllocTRES=cpu=32,mem=128G,node=2,billing=32,gres/gpu=2,gres/gpu:l4=1,gres/gpu:l40s=1
   Socks/Node=* NtasksPerN:B:S:C=1:0:*:* CoreSpec=*
   MinCPUsNode=16 MinMemoryNode=64G MinTmpDiskNode=0
   Features=(null) DelayBoot=00:00:00
   OverSubscribe=OK Contiguous=0 Licenses=(null) Network=(null)
   Command=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260720-184320-luqia-vllm-pd-tcp-2node-r2/run.sbatch
   WorkDir=/data/users/chjing/Sweep_LLM_Jobs_broker
   StdErr=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260720-184320-luqia-vllm-pd-tcp-2node-r2/slurm-249403.err
   StdIn=/dev/null
   StdOut=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260720-184320-luqia-vllm-pd-tcp-2node-r2/slurm-249403.out
   Power=
   TresPerNode=gres/gpu:1
   TresPerTask=cpu:8
   


===== 100gbe_and_environment_preflight =====
[NVGPUFREQ][INFO] The spank nvgpufreq plugin has been loaded!
[NVGPUFREQ][ERROR] Failed to retrive the job ID from slurmctld! Exit!
host=ganymede role=decode mode=preflight
node_ip=10.1.0.3 peer_ip=10.1.0.6 interface=eno12399np0
host=neptune role=prefill mode=preflight
node_ip=10.1.0.6 peer_ip=10.1.0.3 interface=enp160s0f0np0
CUDA_VISIBLE_DEVICES=0
CUDA_VISIBLE_DEVICES=1
eno12399np0      UP             10.1.0.3/16 fe80::632:1ff:fe4d:80/64 
10.1.0.6 dev eno12399np0 src 10.1.0.3 uid 10271 
    cache 
link_speed_mbps=100000
link_mtu=1500
enp160s0f0np0    UP             10.1.0.6/16 fe80::6e92:cfff:fe5e:cc00/64 
10.1.0.3 dev enp160s0f0np0 src 10.1.0.6 uid 10271 
    cache 
link_speed_mbps=100000
link_mtu=1500
index, name, memory.total [MiB], driver_version
0, NVIDIA L4, 23034 MiB, 595.71.05
1, NVIDIA L4, 23034 MiB, 595.71.05
index, name, memory.total [MiB], driver_version
2, NVIDIA L4, 23034 MiB, 595.71.05
3, NVIDIA L4, 23034 MiB, 595.71.05
4, NVIDIA L4, 23034 MiB, 595.71.05
5, NVIDIA L4, 23034 MiB, 595.71.05
6, NVIDIA L4, 23034 MiB, 595.71.05
7, NVIDIA L4, 23034 MiB, 595.71.05
0, NVIDIA L40S, 46068 MiB, 595.71.05
1, NVIDIA L40S, 46068 MiB, 595.71.05
2, NVIDIA L40S, 46068 MiB, 595.71.05
3, NVIDIA L40S, 46068 MiB, 595.71.05
host=ganymede import=torch version=2.9.1+cu128
host=ganymede import=vllm version=0.15.1
host=ganymede import=aiohttp version=3.13.3
host=ganymede import=msgpack version=1.1.2
host=ganymede import=zmq version=27.1.0
host=neptune import=torch version=2.9.1+cu128
host=neptune import=vllm version=0.15.1
host=neptune import=aiohttp version=3.13.3
host=neptune import=msgpack version=1.1.2
host=neptune import=zmq version=27.1.0
preflight_rc=0

===== start_proxy =====
proxy_pid=469636
waiting name=proxy elapsed_s=5 url=http://127.0.0.1:30403/health
ready name=proxy elapsed_s=5 url=http://127.0.0.1:30403/health

===== start_prefill_and_decode =====
server_step_pid=469643
waiting name=prefill elapsed_s=5 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=10 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=15 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=20 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=25 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=30 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=35 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=40 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=45 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=50 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=55 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=60 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=65 url=http://10.1.0.6:32403/v1/models
waiting name=prefill elapsed_s=70 url=http://10.1.0.6:32403/v1/models
ready name=prefill elapsed_s=70 url=http://10.1.0.6:32403/v1/models
ready name=decode elapsed_s=0 url=http://10.1.0.3:33403/v1/models

===== wait_for_pd_registry =====
{"prefill": ["10.1.0.6:32403"], "decode": ["10.1.0.3:33403"]}
registry_ready=true

===== pd_smoke_request =====
{"id":"cmpl-___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_2175b22994224699b0b5047475886231","object":"text_completion","created":1784565933,"model":"mistralai/Mistral-7B-v0.1","choices":[{"index":0,"text":" Stockholm, which is also the largest city in the country. Stockholm is located on the east coast of Sweden, on the Baltic Sea. The city is built","logprobs":null,"finish_reason":"length","stop_reason":null,"token_ids":null,"prompt_logprobs":null,"prompt_token_ids":null}],"service_tier":null,"system_fingerprint":null,"usage":{"prompt_tokens":6,"total_tokens":38,"completion_tokens":32,"prompt_tokens_details":null},"kv_transfer_params":null}
smoke_curl_rc=0
pd_smoke_valid=true completion_tokens=32 text=' Stockholm, which is also the largest city in the country. Stockholm is located on the east coast of Sweden, on the Baltic Sea. The city is built'

===== pd_vllm_bench =====
bench_rc=0
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7c573f2b11b0>, seed=0, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=512, random_output_len=64, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30403', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=2, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-ac0addb6-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-20 18:45:45 [datasets.py:612] Sampling input_len from [511, 511] and output_len from [64, 64]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:04<00:00,  2.03s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 16/16 [00:20<00:00,  1.29s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             4         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  20.71     
Total input tokens:                      8176      
Total generated tokens:                  1024      
Request throughput (req/s):              0.77      
Output token throughput (tok/s):         49.46     
Peak output token throughput (tok/s):    67.00     
Peak concurrent requests:                6.00      
Total token throughput (tok/s):          444.33    
---------------Time to First Token----------------
Mean TTFT (ms):                          271.21    
Median TTFT (ms):                        270.19    
P99 TTFT (ms):                           309.19    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          59.32     
Median TPOT (ms):                        59.38     
P99 TPOT (ms):                           59.63     
---------------Inter-token Latency----------------
Mean ITL (ms):                           59.32     
Median ITL (ms):                         59.46     
P99 ITL (ms):                            68.25     
==================================================

===== stop_servers_and_collect_logs =====
stopping_server_step_pid=469643
stopping_proxy_pid=469636
--- proxy routes ---
registry_add role=decode http=10.1.0.3:33403 zmq=10.1.0.3:34403
registry_add role=prefill http=10.1.0.6:32403 zmq=10.1.0.6:34403
route count=0 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_2175b22994224699b0b5047475886231 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=1 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_d95a3495c5a440f28be1b1fd7d25e7c7 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=2 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_f96b9247f67a4969a0dff0dbdbcdbd82 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=3 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_9318a9484f9d4209a9c4e54d5a3ae992 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=4 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_c6157c51ac2e4db6a98a69c7867dbe55 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=5 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_c4d8d64d19a2492082c963c9903db848 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=6 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_1f40bd9050bc4919bf592bd70a1eb67c prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=7 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_3ebf83536988486e8a9005799a7e1e23 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=8 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_c4c4c69b11674288871d02b6c30c8b34 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=9 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_39c8f0fca58c4e02b367847beea68e70 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=10 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_685f1d1838fd48e2ae266024769353a4 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=11 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_b6194906b4df4b0b8bf1e6e38ae64a29 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=12 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_14b31df2b16e4e73923016e80185ed87 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=13 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_77b44db15163462dacf2741bd5b62473 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=14 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_42b3c94fa2ab4755bd27460058160f84 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=15 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_95b3f35007f1455599d446ee1bde6ea6 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=16 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_1b3fc31f3e2b4c98834ff4818156f223 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=17 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_4a939632223b49d1adcd333a05196fab prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
route count=18 request_id=___prefill_addr_10.1.0.6:34403___decode_addr_10.1.0.3:34403_1dce12e7d8784b7cbab0721cdfbb8c87 prefill_http=10.1.0.6:32403 decode_http=10.1.0.3:33403
--- P2P connector evidence ---
(APIServer pid=421155) INFO 07-20 18:44:43 [utils.py:261] non-default args: {'model_tag': 'mistralai/Mistral-7B-v0.1', 'api_server_count': 1, 'host': '0.0.0.0', 'port': 32403, 'model': 'mistralai/Mistral-7B-v0.1', 'dtype': 'float16', 'max_model_len': 4096, 'enforce_eager': True, 'gpu_memory_utilization': 0.82, 'max_num_batched_tokens': 4096, 'max_num_seqs': 32, 'kv_transfer_config': KVTransferConfig(kv_connector='P2pNcclConnector', engine_id='0bf94e9f-6b1e-4821-bc21-bea8d41e8ac5', kv_buffer_device='cuda', kv_buffer_size=10.0, kv_role='kv_producer', kv_rank=None, kv_parallel_size=1, kv_ip='127.0.0.1', kv_port=34403, kv_connector_extra_config={'proxy_ip': '10.1.0.3', 'proxy_port': '31403', 'http_port': '32403', 'send_type': 'PUT_ASYNC', 'nccl_num_channels': '16'}, kv_connector_module_path=None, enable_permute_local_kv=False, kv_load_failure_policy='recompute')}
(EngineCore_DP0 pid=421333) INFO 07-20 18:45:11 [factory.py:64] Creating v1 connector with name: P2pNcclConnector and engine_id: 0bf94e9f-6b1e-4821-bc21-bea8d41e8ac5
(EngineCore_DP0 pid=421333) INFO 07-20 18:45:24 [p2p_nccl_engine.py:188] 💯P2pNcclEngine init, rank:0, local_rank:0, http_address:10.1.0.6:32403, zmq_address:10.1.0.6:34403, proxy_address:10.1.0.3:31403, send_type:PUT_ASYNC, buffer_size_threshold:10.00, nccl_num_channels:16
(EngineCore_DP0 pid=421333) INFO 07-20 18:45:25 [factory.py:64] Creating v1 connector with name: P2pNcclConnector and engine_id: 0bf94e9f-6b1e-4821-bc21-bea8d41e8ac5
(APIServer pid=469670) INFO 07-20 18:44:34 [utils.py:261] non-default args: {'model_tag': 'mistralai/Mistral-7B-v0.1', 'api_server_count': 1, 'host': '0.0.0.0', 'port': 33403, 'model': 'mistralai/Mistral-7B-v0.1', 'dtype': 'float16', 'max_model_len': 4096, 'enforce_eager': True, 'gpu_memory_utilization': 0.82, 'max_num_batched_tokens': 4096, 'max_num_seqs': 32, 'kv_transfer_config': KVTransferConfig(kv_connector='P2pNcclConnector', engine_id='9ac4dc4a-7d77-416d-b2f4-2d555a00aef0', kv_buffer_device='cuda', kv_buffer_size=8000000000.0, kv_role='kv_consumer', kv_rank=None, kv_parallel_size=1, kv_ip='127.0.0.1', kv_port=34403, kv_connector_extra_config={'proxy_ip': '10.1.0.3', 'proxy_port': '31403', 'http_port': '33403', 'send_type': 'PUT_ASYNC', 'nccl_num_channels': '16'}, kv_connector_module_path=None, enable_permute_local_kv=False, kv_load_failure_policy='recompute')}
(EngineCore_DP0 pid=469795) INFO 07-20 18:44:55 [factory.py:64] Creating v1 connector with name: P2pNcclConnector and engine_id: 9ac4dc4a-7d77-416d-b2f4-2d555a00aef0
(EngineCore_DP0 pid=469795) INFO 07-20 18:45:06 [p2p_nccl_engine.py:188] 💯P2pNcclEngine init, rank:0, local_rank:0, http_address:10.1.0.3:33403, zmq_address:10.1.0.3:34403, proxy_address:10.1.0.3:31403, send_type:PUT_ASYNC, buffer_size_threshold:8000000000.00, nccl_num_channels:16
(EngineCore_DP0 pid=469795) INFO 07-20 18:45:07 [factory.py:64] Creating v1 connector with name: P2pNcclConnector and engine_id: 9ac4dc4a-7d77-416d-b2f4-2d555a00aef0
--- NCCL network evidence ---
ganymede:469795:470149 [0] NCCL INFO NET/Socket : Using [0]eno12399np0:10.1.0.3<0>
ganymede:469795:470149 [0] NCCL INFO Using network Socket
ganymede:469795:470149 [0] NCCL INFO NET/Socket : GPU Direct RDMA Disabled for HCA 0 'eno12399np0'
ganymede:469795:470385 [0] NCCL INFO Channel 01/1 : 0[0] -> 1[1] [receive] via NET/Socket/0/Shared
ganymede:469795:470385 [0] NCCL INFO Channel 09/1 : 0[0] -> 1[1] [receive] via NET/Socket/0/Shared
neptune:421333:421733 [0] NCCL INFO NET/Socket : Using [0]enp160s0f0np0:10.1.0.6<0>
neptune:421333:421733 [0] NCCL INFO Using network Socket
neptune:421333:421733 [0] NCCL INFO NET/Socket : GPU Direct RDMA Disabled for HCA 0 'enp160s0f0np0'
neptune:421333:421820 [0] NCCL INFO Channel 01/1 : 0[0] -> 1[1] [send] via NET/Socket/0/Shared
neptune:421333:421820 [0] NCCL INFO Channel 09/1 : 0[0] -> 1[1] [send] via NET/Socket/0/Shared
nccl_socket_evidence_lines=6
nccl_socket_path_verified=true

===== network_and_gpu_telemetry_summary =====
telemetry_file=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260720-184320-luqia-vllm-pd-tcp-2node-r2/pd_tcp_results/decode_ganymede_telemetry.csv samples=51
network_rx_delta_bytes=1311056545
network_tx_delta_bytes=17015876
gpu_util_max_pct=99.0
telemetry_file=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260720-184320-luqia-vllm-pd-tcp-2node-r2/pd_tcp_results/prefill_neptune_telemetry.csv samples=52
network_rx_delta_bytes=42293072
network_tx_delta_bytes=1276665100
gpu_util_max_pct=46.0

===== result =====
pd_smoke_request_ok=true
pd_bench_rc=0
pd_over_100gbe_tcp_socket_ok=true
job_exit_rc=0
job_cleanup_rc=0